<template>
  <div class="page page_about-me">
    <h1 style="margin-bottom: 40px">About me</h1>
    <p v-for="text in texts" :key="text">
      <strong>{{ text.strong }}</strong>
      {{ text.p }}
    </p>
  </div>
</template>

<script>
export default {
  name: "AboutMe",
  data() {
    return {
      texts: [
        {
          strong: "Быстро и легко учусь.",
          p: " В начале карьеры освоила основы HTML, CSS и JS за месяц и сделала свой первый проект в агентстве. Кроме того, в дальнейшем приходилось в короткие сроки учиться использовать и внедрять различные библиотеки (PIXI.js, Babylon.js), с чем я так же успешно справлялась.",
        },
        {
          strong: "Продвинутый уровень английского языка (B2-C1),",
          p: " подтверждённый международными сертификатами (IELTS, CAE). Свободно говорю, читаю и пишу на английском, в том числе могу работать с технической документацией.",
        },
        {
          strong: "Умение мыслить креативно.",
          p: " Всегда стараюсь найти оптимальное решение задачи. Готова разрабатывать и внедрять новые фичи, работать над улучшением качества продукта.",
        },
        {
          strong: "Ответсвенность.",
          p: " Всегда выполняю задачи в поставленные сроки.",
        },
        {
          strong: "Открытость новому.",
          p: " С радостью изучаю новые технологии.",
        },
      ],
    };
  },
};
</script>

<style lang="sass" src="../assets/styles/AboutMe.sass"></style>
